import rita.*;

String haikuGrammar = 
  "{\"<start>\": \"<5-line> % <7-line> % <5-line>\","
  + "\"<5-line>\": \"<1> <2> <3> | <5> | <2> | <3> <2> | <3.1> <2> <3> <4> | <3.1> | <2> <3.1> | <3> <1> <2> <4> | <3> <1> <2> <5>  \","
  + "\"<7-line>\": \"<6> <6> <4> | <6> | <3> | <6> <4> | <3.1> <6> <4> | <5> \","
/* яке? */  + "\"<1>\": \"червоне | біле | чорне | падаюче | моє | твоє | либонь |блакитне | зелене | нічне | денне | світанкове | пташине | сіре | хвиллююче | жовте | вільне | тендітне\","
/* де? */   + "\"<2>\": \"у морі | перед очима | між рядків | на небі | вгорі | на сході | в пітьмі | в думках | в пустоті | в буддійській самостності | в храмі | під покровом | на океанському дні | у киданні | над світом | на рисовім полі | в падінні | в повітрі | між світами | у снах Будди | у проповідях Заратустри | в уяві | на тому березі ріки | на стіні | звідусіль | в астралі | в церкві | на землі\","
/* що? с.р */   + "\"<3>\": \"небо | сонце | вікно | дерево | чоло | болото | намисто | місто | вас | ледащо | весло | кохання | життя | обличчя | лахміття | хайку | листя | заняття | шмаття | терпіння\","
/* хто?/що? ж.р. */   + "\"<3.1>\": \"ворона | мова | книга | птаха | дитина | кохана | дівчина | ніч | турбота | рука | лисиця | туга | любов | оленина | днина | сакура | річ | сукня | гейша | риба | краса | сила | душа | дурість | корона | лисина | доброта | мужність | воля | доля | крига | ницість | хтивість | пиха | долина | гора | хмара | совість | хоробрість\","
/* що робить?*/   + "\"<4>\": \"тримає | народжує | кличе | вбиває | звеличує | мружить | сумує | турбує | заводить | обходить | буває | тікає | чекає | фігачить | бачить | знає | велить | гає | гоїть | звучить | говорить | губить | йде | блідне | тріскається | порушує | мовчить | терпить | бунтує | вирощує\","
/* що ще робить?*/   + "\"<5>\": \"ламає | руйнує | смішить | тішить | кричить | збуджує | вабить | заспокоює | вчить | забирає | спить | дзвенить | співає | чхає | промовляє | виснажує \","
/* як? як це?*/   + "\"<6>\": \" нещадно | печально | грубо | чарівно | неймовірно | мене |тобі | мені | наче зомбі | нашо те все | тебе | грубо | нахабно | низько | велично | світло | довершено | недобито | вічно | безсоромно | грайливо | квапливо | незграбно | швидко | точно\"}";

RiGrammar grammar;
RiText[] rts = new RiText[3];

void setup()
{
  size(612, 612);
  
  RiText.defaultFont("Tahoma", 26);
  RiText.defaults.alignment = CENTER;
  

  rts[0] = new RiText(this, "клікніть, ", width / 2, height / 2.25);
  rts[1] = new RiText(this, "щоб згенерувати", width / 2, height / 2);
  rts[2] = new RiText(this, "хайку", width / 2, height / 1.8);

  grammar = new RiGrammar(haikuGrammar);
  
}

void draw()
{
  //background(238, 154, 0);
  background(241, 230, 228);
  for (int k = 0; k < rts.length; k++)
    rts[k].draw();
  
  color c = color(0, 126, 255, 0);
  stroke(210, 202, 200);
  strokeWeight(30);
  //rectMode(CENTER);
  fill(c);
  rect(0, 0, 612, 612);
}

void mouseClicked()
{
  String result = grammar.expand();
  String[] lines = result.split("%");
  for (int i = 0; i < rts.length; i++) 
    rts[i].text(lines[i]);
    //println(rts);
    saveStrings("nouns.txt", lines);
}

void keyReleased()
{
if ( key == 's' ) 
{
  saveFrame("frames/haiku####" + ".png"); // зберігає малюнок
  println("Хайку збережено.");
}
}
